RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.3.0_59ac3456/components/libraries/experimental_libuarte/nrf_libuarte.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include "sdk_config.h"
#include "nrf_libuarte.h"
#include "nrf_uarte.h"
#include "nrf_gpio.h"

#define NRF_LOG_MODULE_NAME libUARTE
#if NRF_LIBUARTE_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL       NRF_LIBUARTE_CONFIG_LOG_LEVEL
#define NRF_LOG_INFO_COLOR  NRF_LIBUARTE_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR NRF_LIBUARTE_CONFIG_DEBUG_COLOR
#else // NRF_LIBUARTE_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL       0
#endif // NRF_LIBUARTE_CONFIG_LOG_ENABLED
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

#define MAX_DMA_XFER_LEN    ((1UL << UARTE0_EASYDMA_MAXCNT_SIZE) - 1)

#define INTERRUPTS_MASK  \
    (NRF_UARTE_INT_ENDRX_MASK | NRF_UARTE_INT_RXSTARTED_MASK | NRF_UARTE_INT_ERROR_MASK | \
     NRF_UARTE_INT_ENDTX_MASK | NRF_UARTE_INT_TXSTOPPED_MASK)

/** Macro is setting up PPI channel set which consist of event, task and optional fork.
 *
 * @param _ch   Channel.
 * @param _evt  Event.
 * @param _tsk  Task.
 * @param _fork Fork. If NULL fork is not configured.
 */
#define PPI_CH_SETUP(_ch, _evt, _tsk, _fork)            \
    ret = nrfx_ppi_channel_assign(_ch, _evt, _tsk);     \
    if (ret != NRFX_SUCCESS)                            \
    {                                                   \
        return NRF_ERROR_INTERNAL;                      \
    }                                                   \
    if (_fork)                                          \
    {                                                   \
        ret = nrfx_ppi_channel_fork_assign(_ch, _fork); \
        if (ret != NRFX_SUCCESS)                        \
        {                                               \
            return NRF_ERROR_INTERNAL;                  \
        }                                               \
    }

/** Macro for setting up PPI group with one channel and getting tasks to
 *  control that group.
 *
 * @param[in] _ch       Channel to be included in the group.
 * @param[in] _group    Group.
 * @param[out] _en_tsk  Address of the task to enable group.
 * @param[out] _dis_tsk Address of the task to disable group.
 */
#define PPI_GROUP_SETUP(_ch, _group, _en_tsk, _dis_tsk)           \
        ret = nrfx_ppi_channel_include_in_group(_ch,  _group);    \
        if (ret != NRFX_SUCCESS)                                  \
        {                                                         \
            return NRF_ERROR_INTERNAL;                            \
        }                                                         \
        _en_tsk = nrfx_ppi_task_addr_group_enable_get(_group);    \
        _dis_tsk = nrfx_ppi_task_addr_group_disable_get(_group)

static const nrf_libuarte_t * m_libuarte_instance[2];

static ret_code_t ppi_configure(const nrf_libuarte_t * const p_libuarte,
                                nrf_libuarte_config_t * p_config)
{
    nrfx_err_t ret;

/*lint -save -e666 */

    uint32_t group1_en_tsk = 0;
    uint32_t group1_dis_tsk = 0;
    uint32_t group2_en_tsk = 0;
    uint32_t group2_dis_tsk = 0;

    if (p_config->endrx_evt)
    {
        PPI_GROUP_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_ENDRX_STARTRX],
                        p_libuarte->ctrl_blk->ppi_groups[NRF_LIBUARTE_PPI_GROUP_ENDRX_STARTRX],
                        group1_en_tsk, group1_dis_tsk);

        PPI_CH_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_ENDRX_STARTRX],
                     nrf_uarte_event_address_get(p_libuarte->uarte, NRF_UARTE_EVENT_ENDRX),
                     nrf_uarte_task_address_get(p_libuarte->uarte, NRF_UARTE_TASK_STARTRX),
                     nrfx_timer_capture_task_address_get(&p_libuarte->timer, 0));

        PPI_GROUP_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_ENDRX_EXT_TSK],
                        p_libuarte->ctrl_blk->ppi_groups[NRF_LIBUARTE_PPI_GROUP_ENDRX_EXT_RXDONE_TSK],
                        group2_en_tsk, group2_dis_tsk);

        PPI_CH_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_EXT_TRIGGER_STARTRX_EN_ENDRX_STARTX],
                     p_config->startrx_evt,
                     nrf_uarte_task_address_get(p_libuarte->uarte, NRF_UARTE_TASK_STARTRX),
                     group1_en_tsk);
    }
    else
    {
        PPI_CH_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_EXT_TRIGGER_STARTRX_EN_ENDRX_STARTX],
                     p_config->startrx_evt,
                     nrf_uarte_task_address_get(p_libuarte->uarte, NRF_UARTE_TASK_STARTRX),
                     nrfx_timer_capture_task_address_get(&p_libuarte->timer, 0));
    }

    if (p_config->endrx_evt && p_config->rxdone_tsk)
    {
        PPI_CH_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_ENDRX_EXT_TSK],
                     nrf_uarte_event_address_get(p_libuarte->uarte, NRF_UARTE_EVENT_ENDRX),
                     nrfx_timer_capture_task_address_get(&p_libuarte->timer, 0),
                     p_config->rxdone_tsk);
    }


    if (p_config->rxstarted_tsk)
    {
        PPI_CH_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_RXSTARTED_EXT_TSK],
                     nrf_uarte_event_address_get(p_libuarte->uarte, NRF_UARTE_EVENT_RXSTARTED),
                     group2_dis_tsk,
                     p_config->rxstarted_tsk);
    }

