RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.3.0_59ac3456/components/libraries/experimental_libuarte/nrf_libuarte.c
    if (p_config->endrx_evt)
    {
        PPI_CH_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_EXT_STOP_STOPRX],
                     p_config->endrx_evt,
                     nrf_uarte_task_address_get(p_libuarte->uarte, NRF_UARTE_TASK_STOPRX),
                     group2_en_tsk);

        PPI_CH_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_EXT_STOP_GROUPS_EN],
                     p_config->endrx_evt,
                     group1_dis_tsk,
                     nrfx_timer_capture_task_address_get(&p_libuarte->timer, 1));
    }

    if (MAX_DMA_XFER_LEN < UINT16_MAX)
    {
        PPI_CH_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_ENDTX_STARTTX],
                     nrf_uarte_event_address_get(p_libuarte->uarte, NRF_UARTE_EVENT_ENDTX),
                     nrf_uarte_task_address_get(p_libuarte->uarte, NRF_UARTE_TASK_STARTTX),
                     0);
    }

    PPI_CH_SETUP(p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_PPI_CH_RXRDY_TIMER_COUNT],
                 nrf_uarte_event_address_get(p_libuarte->uarte, NRF_UARTE_EVENT_RXDRDY),
                 nrfx_timer_task_address_get(&p_libuarte->timer, NRF_TIMER_TASK_COUNT),
                 0);

    if (ret != NRFX_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

    return NRF_SUCCESS;
/*lint -restore */
}

void tmr_evt_handler(nrf_timer_event_t event_type, void * p_context)
{
    UNUSED_PARAMETER(event_type);
    UNUSED_PARAMETER(p_context);
}

ret_code_t nrf_libuarte_init(const nrf_libuarte_t * const p_libuarte,
                             nrf_libuarte_config_t * p_config,
                             nrf_libuarte_evt_handler_t evt_handler,
                             void * context)
{
    ret_code_t ret;
    IRQn_Type irqn = nrfx_get_irq_number(p_libuarte->uarte);

    p_libuarte->ctrl_blk->evt_handler = evt_handler;
    p_libuarte->ctrl_blk->p_cur_rx = NULL;
    p_libuarte->ctrl_blk->p_next_rx = NULL;
    p_libuarte->ctrl_blk->p_next_next_rx = NULL;
    p_libuarte->ctrl_blk->p_tx = NULL;
    p_libuarte->ctrl_blk->context = context;

    m_libuarte_instance[p_libuarte->uarte == NRF_UARTE0 ? 0 : 1] = p_libuarte;

    //UART init
    nrf_gpio_pin_set(p_config->tx_pin);
    nrf_gpio_cfg_output(p_config->tx_pin);
    nrf_gpio_cfg_input(p_config->rx_pin, NRF_GPIO_PIN_NOPULL);
    nrf_uarte_baudrate_set(p_libuarte->uarte, p_config->baudrate);
    nrf_uarte_configure(p_libuarte->uarte, p_config->parity, p_config->hwfc);
    nrf_uarte_txrx_pins_set(p_libuarte->uarte, p_config->tx_pin, p_config->rx_pin);

    if (p_config->hwfc == NRF_UARTE_HWFC_ENABLED)
    {
        if (p_config->cts_pin != NRF_UARTE_PSEL_DISCONNECTED)
        {
            nrf_gpio_cfg_input(p_config->cts_pin, NRF_GPIO_PIN_NOPULL);
        }
        if (p_config->rts_pin != NRF_UARTE_PSEL_DISCONNECTED)
        {
            nrf_gpio_pin_set(p_config->rts_pin);
            nrf_gpio_cfg_output(p_config->rts_pin);
        }
        nrf_uarte_hwfc_pins_set(p_libuarte->uarte, p_config->rts_pin, p_config->cts_pin);
    }

    nrf_uarte_int_enable(p_libuarte->uarte, INTERRUPTS_MASK);

    NVIC_SetPriority(irqn, p_config->irq_priority);
    NVIC_ClearPendingIRQ(irqn);
    NVIC_EnableIRQ(irqn);

    nrf_uarte_enable(p_libuarte->uarte);

    nrfx_timer_config_t tmr_config = NRFX_TIMER_DEFAULT_CONFIG;
    tmr_config.mode = NRF_TIMER_MODE_COUNTER;
    tmr_config.bit_width = NRF_TIMER_BIT_WIDTH_32;
    ret = nrfx_timer_init(&p_libuarte->timer, &tmr_config, tmr_evt_handler);
    if (ret != NRFX_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }
    nrfx_timer_enable(&p_libuarte->timer);
    nrfx_timer_clear(&p_libuarte->timer);
    p_libuarte->ctrl_blk->last_rx_byte_cnt = 0;
    p_libuarte->ctrl_blk->last_pin_rx_byte_cnt = 0;

    uint32_t i;
    for (i = 0; i < NRF_LIBUARTE_PPI_CH_MAX; i++)
    {
        if ((p_config->endrx_evt == 0) &&
            ((i == NRF_LIBUARTE_PPI_CH_EXT_STOP_STOPRX) ||
             (i == NRF_LIBUARTE_PPI_CH_EXT_STOP_GROUPS_EN) ||
             (i == NRF_LIBUARTE_PPI_CH_ENDRX_STARTRX) ||
             (i == NRF_LIBUARTE_PPI_CH_ENDRX_EXT_TSK)
             )
           ) {
            // skip ppi allocation
            p_libuarte->ctrl_blk->ppi_channels[i] = (nrf_ppi_channel_t)PPI_CH_NUM;
        }
        else if (p_config->rxstarted_tsk == 0 &&
                (i == NRF_LIBUARTE_PPI_CH_RXSTARTED_EXT_TSK))
        {
            p_libuarte->ctrl_blk->ppi_channels[i] = (nrf_ppi_channel_t)PPI_CH_NUM;
        }
        else if ((MAX_DMA_XFER_LEN >= UINT16_MAX) &&
                (i == NRF_LIBUARTE_PPI_CH_ENDTX_STARTTX))
        {
            p_libuarte->ctrl_blk->ppi_channels[i] = (nrf_ppi_channel_t)PPI_CH_NUM;
        }
        else
        {
            ret = nrfx_ppi_channel_alloc(&p_libuarte->ctrl_blk->ppi_channels[i]);
            if (ret != NRFX_SUCCESS)
            {
                //we don't free already allocated channels, system is wrongly configured.
                return NRF_ERROR_INTERNAL;
            }
        }
    }

    for (i = 0; i < NRF_LIBUARTE_PPI_GROUP_MAX; i++)
    {
        if (p_config->endrx_evt)
        {
            ret = nrfx_ppi_group_alloc(&p_libuarte->ctrl_blk->ppi_groups[i]);
            if (ret != NRFX_SUCCESS)
            {
                //we don't free already allocated channels, system is wrongly configured.
                return NRF_ERROR_INTERNAL;
            }
        }
        else
        {
            p_libuarte->ctrl_blk->ppi_groups[i] = (nrf_ppi_channel_group_t)PPI_GROUP_NUM;
        }
    }

    return ppi_configure(p_libuarte, p_config);
}

void nrf_libuarte_uninit(const nrf_libuarte_t * const p_libuarte)
{
    IRQn_Type irqn = nrfx_get_irq_number(p_libuarte->uarte);

    NVIC_DisableIRQ(irqn);
    nrf_uarte_int_disable(p_libuarte->uarte, 0xFFFFFFFF);
    nrf_uarte_disable(p_libuarte->uarte);

    nrfx_timer_disable(&p_libuarte->timer);
    nrfx_timer_uninit(&p_libuarte->timer);

    uint32_t i;
    ret_code_t ret;
    for (i = 0; i < NRF_LIBUARTE_PPI_CH_MAX; i++)
    {
        if (p_libuarte->ctrl_blk->ppi_channels[i] < PPI_CH_NUM)
        {
            ret = nrfx_ppi_channel_disable(p_libuarte->ctrl_blk->ppi_channels[i]);
            ASSERT(ret == NRFX_SUCCESS)
            ret = nrfx_ppi_channel_free(p_libuarte->ctrl_blk->ppi_channels[i]);
            ASSERT(ret == NRFX_SUCCESS)
        }
    }

    for (i = 0; i < NRF_LIBUARTE_PPI_GROUP_MAX; i++)
    {
        if (p_libuarte->ctrl_blk->ppi_groups[i] < PPI_GROUP_NUM)
        {
            ret = nrfx_ppi_group_free(p_libuarte->ctrl_blk->ppi_groups[i]);
            ASSERT(ret == NRFX_SUCCESS)
        }
    }

